app/controllers/home_controller.rb

SELECT `surveys`.* FROM `surveys` LIMIT 3
---
  def index
    @surveys = Survey.limit(3)