app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.paginate :page => params[:page], :order => "created_at DESC"
---
SELECT COUNT(*) FROM `surveys`
SELECT `surveys`.* FROM `surveys` ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @survey = Survey.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 980190962 LIMIT 1

  def edit
    @survey = current_user.surveys.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`user_id` = 135138680 AND `surveys`.`id` = 532021197 LIMIT 1

  def create
    @survey = current_user.surveys.new(params[:survey])
    if @survey.save
---
INSERT INTO `surveys` (`created_at`, `name`, `question_type`, `updated_at`, `user_id`) VALUES ('2013-03-31 10:50:02', 'Employee Survey', 'Essay', '2013-03-31 10:50:02', 135138680)

  def update
    @survey = current_user.surveys.find(params[:id])
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`user_id` = 135138680 AND `surveys`.`id` = 532021197 LIMIT 1

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT `surveys`.* FROM `surveys` WHERE `surveys`.`id` = 980190962 LIMIT 1
DELETE FROM `surveys` WHERE `surveys`.`id` = 980190962

  def results
    @surveys = Survey.paginate :page => params[:page], :order => "created_at DESC"
---
SELECT `surveys`.* FROM `surveys` ORDER BY created_at DESC LIMIT 10 OFFSET 0