app/controllers/surveys_controller.rb

SELECT `responses`.* FROM `responses` WHERE `responses`.`survey_id` = 532021197
---
  def results
    @responses = @survey.responses.paginate :page => params[:page], :order => 'created_at DESC'